vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Microchip.PIC32CM-GV_DFP.pdsc
         <device Dname="PIC32CM3204GV00048">
            <processor Dcore="Cortex-M0+"
                       Dendian="Little-endian"
                       Dmpu="NO_MPU"
                       Dfpu="NO_FPU"
                       Ddsp="NO_DSP"
                       Dtz="NO_TZ"
                       Dclock="48000000"
                       DcoreVersion="r0p0"/>
            <debugconfig default="swd" clock="2000000"/>
            <compile header="PIC32CM-GV00/include/pic32c.h" define="__PIC32CM3204GV00048__"/>
            <debug svd="PIC32CM-GV00/svd/PIC32CM3204GV00048.svd"/>
            <memory name="FLASH"
                    start="0x00000000"
                    size="0x8000"
                    access="rwx"
                    default="1"
                    startup="1"/>
            <memory name="HRAMC0"
                    start="0x20000000"
                    size="0x1000"
                    default="1"
                    access="rwx"/>
            <memory name="HPB0" start="0x40000000" size="0x10000" access="rwp"/>
            <memory name="HPB1" start="0x41000000" size="0x10000" access="rwp"/>
            <memory name="HPB2" start="0x42000000" size="0x10000" access="rwp"/>
            <memory name="PPB" start="0xE0000000" size="0x100000" access="rwp"/>
            <memory name="SCS" start="0xE000E000" size="0x00001000" access="rwp"/>
            <memory name="PERIPHERALS"
                    start="0x40000000"
                    size="0x20000000"
                    access="rwp"/>
            <debugport __dp="0">
               <swd/>
            </debugport>
            <algorithm name="PIC32CM-GV00/keil/Flash/PIC32CM_GV_32_FLASH.FLM"
                       start="0x00000000"
                       size="0x00008000"
                       RAMstart="0x20000000"
                       RAMsize="0x1000"
                       default="1"
                       style="CMSIS"/>
            <environment name="atmel">
               <at:extension xmlns:at="http://www.atmel.com/schemas/pack-device-atmel-extension"
                             schemaVersion="1.0"
                             xsi:schemaLocation="http://www.atmel.com/schemas/pack-device-atmel-extension PACK.DEVICE.ATMEL.EXTENSION.xsd"><!--https://schemas.microchip.com/com/microchip/packs/extensions/at/1.0/PACK.DEVICE.ATMEL.EXTENSION.xsd-->
                  <at:atdf name="PIC32CM-GV00/atdf/PIC32CM3204GV00048.atdf"/>
                  <at:variant ordercode="PIC32CM3204GV00048-I/U5B"
                              vccmin="1.62"
                              vccmax="3.63"
                              tempmin="-40"
                              tempmax="85"/>
                  <at:variant ordercode="PIC32CM3204GV00048-E/U5B"
                              vccmin="1.62"
                              vccmax="3.63"
                              tempmin="-40"
                              tempmax="125"/>
                  <at:variant ordercode="PIC32CM3204GV00048-I/Y8X"
                              vccmin="1.62"
                              vccmax="3.63"
                              tempmin="-40"
                              tempmax="85"/>
                  <at:variant ordercode="PIC32CM3204GV00048-E/Y8X"
                              vccmin="1.62"
                              vccmax="3.63"
                              tempmin="-40"
                              tempmax="125"/>
                  <at:memory name="FLASH"
                             start="0x00000000"
                             size="0x8000"
                             type="flash"
                             pagesize="64"
                             rw="RW"
                             exec="true"
                             address-space="base"/>
                  <at:memory name="CAL"
                             start="0x00800000"
                             size="0x8"
                             type="fuses"
                             rw="R"
                             address-space="base"/>
                  <at:memory name="LOCKBIT"
                             start="0x00802000"
                             size="0x4"
                             type="fuses"
                             rw="R"
                             address-space="base"/>
                  <at:memory name="OTP1"
                             start="0x00806000"
                             size="0x8"
                             type="fuses"
                             rw="R"
                             address-space="base"/>
                  <at:memory name="OTP2"
                             start="0x00806008"
                             size="0x8"
                             type="fuses"
                             rw="R"
                             address-space="base"/>
                  <at:memory name="OTP4"
                             start="0x00806020"
                             size="0xE0"
                             type="fuses"
                             pagesize="64"
                             rw="RW"
                             address-space="base"/>
                  <at:memory name="TEMP_LOG"
                             start="0x00806030"
                             size="0x8"
                             type="fuses"
                             rw="R"
                             address-space="base"/>
                  <at:memory name="USER_PAGE"
                             start="0x00804000"
                             size="0x100"
                             type="user_page"
                             pagesize="64"
                             rw="RW"
                             address-space="base"/>
                  <at:memory name="HRAMC0"
                             start="0x20000000"
                             size="0x1000"
                             type="ram"
                             rw="RW"
                             exec="true"
                             address-space="base"/>
                  <at:memory name="HPB0"
                             start="0x40000000"
                             size="0x10000"
                             type="io"
                             rw="RW"
                             address-space="base"/>
                  <at:memory name="HPB1"
                             start="0x41000000"
                             size="0x10000"
                             type="io"
                             rw="RW"
                             address-space="base"/>
                  <at:memory name="HPB2"
                             start="0x42000000"
                             size="0x10000"
                             type="io"
                             rw="RW"
                             address-space="base"/>
                  <at:memory name="PPB"
                             start="0xE0000000"
                             size="0x100000"
                             type="io"
                             rw="RW"
                             address-space="base"/>
                  <at:memory name="SCS"
                             start="0xE000E000"
                             size="0x00001000"
                             type="io"
                             rw="RW"
                             address-space="base"/>
                  <at:memory name="PERIPHERALS"
                             start="0x40000000"
                             size="0x20000000"
                             type="io"
                             rw="RW"
                             address-space="base"/>
                  <at:interface type="swd" name="SWD"/>
                  <at:tool id="com.atmel.avrdbg.tool.atmelice"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbgc"/>
                  <at:tool id="com.atmel.avrdbg.tool.ice4"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagice3plus"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagicemk3"/>
                  <at:tool id="com.atmel.avrdbg.tool.medbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.nedbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.pickit4"/>
                  <at:tool id="com.atmel.avrdbg.tool.powerdebugger"/>
                  <at:tool id="com.atmel.avrdbg.tool.samice"/>
                  <at:tool id="com.atmel.avrdbg.tool.snap"/>
                  <at:project name="Barebone C Project">
                     <at:component Cvendor="ARM" Cclass="CMSIS" Cgroup="CORE"/>
                     <at:component Cvendor="Microchip" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.c)"/>
                     </at:component>
                  </at:project>
                  <at:project name="Barebone Cpp Project">
                     <at:component Cvendor="ARM" Cclass="CMSIS" Cgroup="CORE"/>
                     <at:component Cvendor="Microchip" Cclass="Device" Cgroup="Startup">
                        <at:template select="Main file (.cpp)"/>
                     </at:component>
                  </at:project>
                  <at:prerequisite context="compiling" Tcompiler="GCC" component="ARM-GCC"/>
                  <at:prerequisite context="compiling" Tcompiler="IAR" component="ARM-IAR"/>
                  <at:prerequisite context="compiling" Tcompiler="ARMCC" component="ARMCC"/>
               </at:extension>
            </environment>
            <environment name="microchip">
               <mchp:extension xmlns:mchp="http://crownking/pack-device-microchip-extension"
                               schemaVersion="1.0"
                               xsi:schemaLocation="http://crownking/pack-device-microchip-extension PACK.DEVICE.MICROCHIP.EXTENSION.xsd"><!--https://schemas.microchip.com/com/microchip/packs/extensions/mchp/1.0/PACK.DEVICE.MICROCHIP.EXTENSION.xsd-->
                  <mchp:pic name="PIC32CM-GV00/edc/PIC32CM3204GV00048.PIC"/>
                  <mchp:xc32 name="PIC32CM-GV00/xc32"/>
                  <mchp:hwtool type="mplab.mpheader">
                     <mchp:file name="PIC32CM-GV00/hwtools/mplab/MPHeader.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="mplab.pluginboardsupport">
                     <mchp:file name="PIC32CM-GV00/hwtools/mplab/PluginBoardSupport.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="sdm">
                     <mchp:file name="PIC32CM-GV00/hwtools/sdm/sdmCompilers.xml"/>
                     <mchp:file name="PIC32CM-GV00/hwtools/sdm/sdmDebuggerMap.xml"/>
                     <mchp:file name="PIC32CM-GV00/hwtools/sdm/sdmICD3.xml"/>
                     <mchp:file name="PIC32CM-GV00/hwtools/sdm/sdmICD4.xml"/>
                     <mchp:file name="PIC32CM-GV00/hwtools/sdm/sdmICD5.xml"/>
                     <mchp:file name="PIC32CM-GV00/hwtools/sdm/sdmICE4.xml"/>
                     <mchp:file name="PIC32CM-GV00/hwtools/sdm/sdmRealICE.xml"/>
                     <mchp:file name="PIC32CM-GV00/hwtools/sdm/sdmRealICE4.xml"/>
                     <mchp:file name="PIC32CM-GV00/hwtools/sdm/sdmSimulator.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="persfr">
                     <mchp:file name="PIC32CM-GV00/hwtools/persfr/arm32.persfr"/>
                  </mchp:hwtool>
                  <mchp:prerequisite component="MPLAB X IDE" version="[5.20-"/>
               </mchp:extension>
            </environment>
            <book name="https://www.microchip.com/en-us/product/PIC32CM3204GV00048"
                  title="Device page for PIC32CM3204GV00048"/>
            <book name="https://www.microchip.com/en-us/product/PIC32CM3204GV00048#Documentation"
                  title="Datasheet"/>
            <book name="https://developer.arm.com/documentation/dui0662"
                  title="Cortex-M0+ Devices Generic User Guide"/>
            <feature type="NVIC" n="25"/>
            <feature type="ExtInt" n="16"/>
            <feature type="ADC" n="19" m="16"/>
            <feature type="WDT" n="1"/>
            <feature type="MPSerial" n="6"/>
            <feature type="Memory" n="0x8000" name="FLASH"/>
            <feature type="Memory" n="0x1000" name="HRAMC0"/>
            <feature type="VCC" n="1.62" m="3.63"/>
            <feature type="Temp" n="-40" m="125"/>
            <feature type="QFN" n="48"/>
            <feature type="QFP" n="48"/>
         </device>
