vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Microchip.PIC32CM-GV_DFP.pdsc
      <condition id="GCC Lib">
         <require condition="GCC"/>
         <accept Toutput="lib"/>
      </condition>
      <condition id="IAR">
         <accept Tcompiler="IAR"/>
      </condition>
      <condition id="IAR Exe">
         <require condition="IAR"/>
         <accept Toutput="exe"/>
      </condition>
      <condition id="IAR Lib">
         <require condition="IAR"/>
         <accept Toutput="lib"/>
      </condition>
      <condition id="XC">
         <accept Tcompiler="XC"/>
      </condition>
      <condition id="XC Exe">
         <require condition="XC"/>
         <accept Toutput="exe"/>
      </condition>
      <condition id="XC Lib">
         <require condition="XC"/>
         <accept Toutput="lib"/>
      </condition>
      <condition id="C">
         <accept condition="ARMCC"/>
         <accept condition="GCC"/>
         <accept condition="IAR"/>
         <accept condition="XC"/>
      </condition>
      <condition id="C Exe">
         <accept condition="ARMCC Exe"/>
         <accept condition="GCC Exe"/>
         <accept condition="IAR Exe"/>
         <accept condition="XC Exe"/>
      </condition>
      <condition id="C Lib">
         <accept condition="ARMCC Lib"/>
         <accept condition="GCC Lib"/>
         <accept condition="IAR Lib"/>
         <accept condition="XC Lib"/>
      </condition>
      <condition id="PIC32CM1602GV00032">
         <require Dvendor="Microchip:3" Dname="PIC32CM1602GV00032"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="PIC32CM1602GV00048">
         <require Dvendor="Microchip:3" Dname="PIC32CM1602GV00048"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="PIC32CM1602GV00064">
         <require Dvendor="Microchip:3" Dname="PIC32CM1602GV00064"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="PIC32CM3204GV00032">
         <require Dvendor="Microchip:3" Dname="PIC32CM3204GV00032"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="PIC32CM3204GV00048">
         <require Dvendor="Microchip:3" Dname="PIC32CM3204GV00048"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
      <condition id="PIC32CM3204GV00064">
         <require Dvendor="Microchip:3" Dname="PIC32CM3204GV00064"/>
         <require Cclass="CMSIS" Cgroup="CORE"/>
      </condition>
   </conditions>
   <components>
      <component Cvendor="Microchip"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.2.0"
                 condition="PIC32CM1602GV00032">
         <description>Headers and startup code for Microchip PIC32CM1602GV00032</description>
         <files>
            <file condition="C" category="include" name="PIC32CM-GV00/include/"/>
            <file condition="C"
                  category="header"
                  name="PIC32CM-GV00/include/pic32c.h"/>
            <file condition="C Exe"
                  category="source"
                  name="PIC32CM-GV00/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="PIC32CM-GV00/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="PIC32CM-GV00/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="PIC32CM-GV00/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="PIC32CM-GV00/gcc/gcc/startup_pic32cm1602gv00032.c"
                  version="1.2.0"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="PIC32CM-GV00/gcc/system_pic32cm1602gv00032.c"
                  version="1.2.0"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="PIC32CM-GV00/gcc/gcc/pic32cm1602gv00032_flash.ld"
                  version="1.2.0"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="PIC32CM-GV00/gcc/gcc/pic32cm1602gv00032_sram.ld"
                  version="1.2.0"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="PIC32CM-GV00/armcc/armcc/startup_pic32cm1602gv00032.c"
                  version="1.2.0"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="PIC32CM-GV00/armcc/system_pic32cm1602gv00032.c"
                  version="1.2.0"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="linkerScript"
                  name="PIC32CM-GV00/armcc/armcc/pic32cm1602gv00032_flash.sct"
                  version="1.2.0"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="PIC32CM-GV00/iar/iar/startup_pic32cm1602gv00032.c"
                  version="1.2.0"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="PIC32CM-GV00/iar/system_pic32cm1602gv00032.c"
                  version="1.2.0"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="PIC32CM-GV00/iar/config/linker/Microchip/pic32cm1602gv00032/sram.icf"
                  version="1.2.0"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="PIC32CM-GV00/iar/config/linker/Microchip/pic32cm1602gv00032/flash.icf"
                  version="1.2.0"
                  attr="config"/>
            <file condition="XC Exe"
                  category="source"
                  name="PIC32CM-GV00/xc32/PIC32CM1602GV00032/startup_pic32cm1602gv00032.c"
                  version="1.2.0"
                  attr="config"/>
            <file condition="XC Exe"
                  category="source"
                  name="PIC32CM-GV00/gcc/system_pic32cm1602gv00032.c"
                  version="1.2.0"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.2.0"
                 condition="PIC32CM1602GV00048">
         <description>Headers and startup code for Microchip PIC32CM1602GV00048</description>
         <files>
            <file condition="C" category="include" name="PIC32CM-GV00/include/"/>
            <file condition="C"
                  category="header"
                  name="PIC32CM-GV00/include/pic32c.h"/>
            <file condition="C Exe"
                  category="source"
                  name="PIC32CM-GV00/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="PIC32CM-GV00/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="PIC32CM-GV00/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="PIC32CM-GV00/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="PIC32CM-GV00/gcc/gcc/startup_pic32cm1602gv00048.c"
                  version="1.2.0"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="PIC32CM-GV00/gcc/system_pic32cm1602gv00048.c"
                  version="1.2.0"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="PIC32CM-GV00/gcc/gcc/pic32cm1602gv00048_flash.ld"
                  version="1.2.0"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="PIC32CM-GV00/gcc/gcc/pic32cm1602gv00048_sram.ld"
                  version="1.2.0"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="PIC32CM-GV00/armcc/armcc/startup_pic32cm1602gv00048.c"
                  version="1.2.0"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="PIC32CM-GV00/armcc/system_pic32cm1602gv00048.c"
                  version="1.2.0"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="linkerScript"
                  name="PIC32CM-GV00/armcc/armcc/pic32cm1602gv00048_flash.sct"
                  version="1.2.0"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="PIC32CM-GV00/iar/iar/startup_pic32cm1602gv00048.c"
                  version="1.2.0"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="PIC32CM-GV00/iar/system_pic32cm1602gv00048.c"
                  version="1.2.0"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="PIC32CM-GV00/iar/config/linker/Microchip/pic32cm1602gv00048/sram.icf"
                  version="1.2.0"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="PIC32CM-GV00/iar/config/linker/Microchip/pic32cm1602gv00048/flash.icf"
                  version="1.2.0"
                  attr="config"/>
            <file condition="XC Exe"
                  category="source"
                  name="PIC32CM-GV00/xc32/PIC32CM1602GV00048/startup_pic32cm1602gv00048.c"
                  version="1.2.0"
                  attr="config"/>
            <file condition="XC Exe"
                  category="source"
                  name="PIC32CM-GV00/gcc/system_pic32cm1602gv00048.c"
                  version="1.2.0"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.2.0"
                 condition="PIC32CM1602GV00064">
         <description>Headers and startup code for Microchip PIC32CM1602GV00064</description>
         <files>
            <file condition="C" category="include" name="PIC32CM-GV00/include/"/>
            <file condition="C"
                  category="header"
                  name="PIC32CM-GV00/include/pic32c.h"/>
            <file condition="C Exe"
                  category="source"
                  name="PIC32CM-GV00/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="PIC32CM-GV00/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="PIC32CM-GV00/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="PIC32CM-GV00/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="PIC32CM-GV00/gcc/gcc/startup_pic32cm1602gv00064.c"
                  version="1.2.0"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="PIC32CM-GV00/gcc/system_pic32cm1602gv00064.c"
                  version="1.2.0"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="PIC32CM-GV00/gcc/gcc/pic32cm1602gv00064_flash.ld"
                  version="1.2.0"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="PIC32CM-GV00/gcc/gcc/pic32cm1602gv00064_sram.ld"
                  version="1.2.0"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="PIC32CM-GV00/armcc/armcc/startup_pic32cm1602gv00064.c"
                  version="1.2.0"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="PIC32CM-GV00/armcc/system_pic32cm1602gv00064.c"
                  version="1.2.0"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="linkerScript"
                  name="PIC32CM-GV00/armcc/armcc/pic32cm1602gv00064_flash.sct"
                  version="1.2.0"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="PIC32CM-GV00/iar/iar/startup_pic32cm1602gv00064.c"
                  version="1.2.0"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="PIC32CM-GV00/iar/system_pic32cm1602gv00064.c"
                  version="1.2.0"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="PIC32CM-GV00/iar/config/linker/Microchip/pic32cm1602gv00064/sram.icf"
                  version="1.2.0"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="PIC32CM-GV00/iar/config/linker/Microchip/pic32cm1602gv00064/flash.icf"
                  version="1.2.0"
                  attr="config"/>
            <file condition="XC Exe"
                  category="source"
                  name="PIC32CM-GV00/xc32/PIC32CM1602GV00064/startup_pic32cm1602gv00064.c"
                  version="1.2.0"
                  attr="config"/>
            <file condition="XC Exe"
                  category="source"
                  name="PIC32CM-GV00/gcc/system_pic32cm1602gv00064.c"
                  version="1.2.0"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.2.0"
                 condition="PIC32CM3204GV00032">
         <description>Headers and startup code for Microchip PIC32CM3204GV00032</description>
         <files>
            <file condition="C" category="include" name="PIC32CM-GV00/include/"/>
            <file condition="C"
                  category="header"
                  name="PIC32CM-GV00/include/pic32c.h"/>
            <file condition="C Exe"
                  category="source"
                  name="PIC32CM-GV00/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="PIC32CM-GV00/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="PIC32CM-GV00/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="PIC32CM-GV00/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="PIC32CM-GV00/gcc/gcc/startup_pic32cm3204gv00032.c"
                  version="1.2.0"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="PIC32CM-GV00/gcc/system_pic32cm3204gv00032.c"
                  version="1.2.0"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="PIC32CM-GV00/gcc/gcc/pic32cm3204gv00032_flash.ld"
                  version="1.2.0"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="PIC32CM-GV00/gcc/gcc/pic32cm3204gv00032_sram.ld"
                  version="1.2.0"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="PIC32CM-GV00/armcc/armcc/startup_pic32cm3204gv00032.c"
                  version="1.2.0"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="PIC32CM-GV00/armcc/system_pic32cm3204gv00032.c"
                  version="1.2.0"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="linkerScript"
                  name="PIC32CM-GV00/armcc/armcc/pic32cm3204gv00032_flash.sct"
                  version="1.2.0"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="PIC32CM-GV00/iar/iar/startup_pic32cm3204gv00032.c"
                  version="1.2.0"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="PIC32CM-GV00/iar/system_pic32cm3204gv00032.c"
                  version="1.2.0"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="PIC32CM-GV00/iar/config/linker/Microchip/pic32cm3204gv00032/sram.icf"
                  version="1.2.0"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="PIC32CM-GV00/iar/config/linker/Microchip/pic32cm3204gv00032/flash.icf"
                  version="1.2.0"
                  attr="config"/>
            <file condition="XC Exe"
                  category="source"
                  name="PIC32CM-GV00/xc32/PIC32CM3204GV00032/startup_pic32cm3204gv00032.c"
                  version="1.2.0"
                  attr="config"/>
            <file condition="XC Exe"
                  category="source"
                  name="PIC32CM-GV00/gcc/system_pic32cm3204gv00032.c"
                  version="1.2.0"
                  attr="config"/>
         </files>
      </component>
      <component Cvendor="Microchip"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.2.0"
                 condition="PIC32CM3204GV00048">
         <description>Headers and startup code for Microchip PIC32CM3204GV00048</description>
         <files>
            <file condition="C" category="include" name="PIC32CM-GV00/include/"/>
            <file condition="C"
                  category="header"
                  name="PIC32CM-GV00/include/pic32c.h"/>
            <file condition="C Exe"
                  category="source"
                  name="PIC32CM-GV00/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="PIC32CM-GV00/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="PIC32CM-GV00/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="PIC32CM-GV00/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="PIC32CM-GV00/gcc/gcc/startup_pic32cm3204gv00048.c"
                  version="1.2.0"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="PIC32CM-GV00/gcc/system_pic32cm3204gv00048.c"
                  version="1.2.0"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="PIC32CM-GV00/gcc/gcc/pic32cm3204gv00048_flash.ld"
                  version="1.2.0"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="PIC32CM-GV00/gcc/gcc/pic32cm3204gv00048_sram.ld"
                  version="1.2.0"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="PIC32CM-GV00/armcc/armcc/startup_pic32cm3204gv00048.c"
                  version="1.2.0"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="PIC32CM-GV00/armcc/system_pic32cm3204gv00048.c"
                  version="1.2.0"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="linkerScript"
                  name="PIC32CM-GV00/armcc/armcc/pic32cm3204gv00048_flash.sct"
                  version="1.2.0"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="PIC32CM-GV00/iar/iar/startup_pic32cm3204gv00048.c"
                  version="1.2.0"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="PIC32CM-GV00/iar/system_pic32cm3204gv00048.c"
                  version="1.2.0"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="PIC32CM-GV00/iar/config/linker/Microchip/pic32cm3204gv00048/sram.icf"
                  version="1.2.0"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="PIC32CM-GV00/iar/config/linker/Microchip/pic32cm3204gv00048/flash.icf"
                  version="1.2.0"
                  attr="config"/>
            <file condition="XC Exe"
                  category="source"
                  name="PIC32CM-GV00/xc32/PIC32CM3204GV00048/startup_pic32cm3204gv00048.c"
                  version="1.2.0"
                  attr="config"/>
            <file condition="XC Exe"
                  category="source"
                  name="PIC32CM-GV00/gcc/system_pic32cm3204gv00048.c"
                  version="1.2.0"
                  attr="config"/>
         </files>
      </component>
