vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Microchip.PIC32CM-GV_DFP.pdsc
      <component Cvendor="Microchip"
                 Cclass="Device"
                 Cgroup="Startup"
                 Cversion="1.2.0"
                 condition="PIC32CM3204GV00064">
         <description>Headers and startup code for Microchip PIC32CM3204GV00064</description>
         <files>
            <file condition="C" category="include" name="PIC32CM-GV00/include/"/>
            <file condition="C"
                  category="header"
                  name="PIC32CM-GV00/include/pic32c.h"/>
            <file condition="C Exe"
                  category="source"
                  name="PIC32CM-GV00/templates/main.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Exe"
                  category="source"
                  name="PIC32CM-GV00/templates/main.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="C Lib"
                  category="source"
                  name="PIC32CM-GV00/templates/library.c"
                  attr="template"
                  select="Main file (.c)"/>
            <file condition="C Lib"
                  category="source"
                  name="PIC32CM-GV00/templates/library.cpp"
                  attr="template"
                  select="Main file (.cpp)"/>
            <file condition="GCC Exe"
                  category="source"
                  name="PIC32CM-GV00/gcc/gcc/startup_pic32cm3204gv00064.c"
                  version="1.2.0"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="source"
                  name="PIC32CM-GV00/gcc/system_pic32cm3204gv00064.c"
                  version="1.2.0"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="PIC32CM-GV00/gcc/gcc/pic32cm3204gv00064_flash.ld"
                  version="1.2.0"
                  attr="config"/>
            <file condition="GCC Exe"
                  category="linkerScript"
                  name="PIC32CM-GV00/gcc/gcc/pic32cm3204gv00064_sram.ld"
                  version="1.2.0"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="PIC32CM-GV00/armcc/armcc/startup_pic32cm3204gv00064.c"
                  version="1.2.0"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="source"
                  name="PIC32CM-GV00/armcc/system_pic32cm3204gv00064.c"
                  version="1.2.0"
                  attr="config"/>
            <file condition="ARMCC Exe"
                  category="linkerScript"
                  name="PIC32CM-GV00/armcc/armcc/pic32cm3204gv00064_flash.sct"
                  version="1.2.0"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="PIC32CM-GV00/iar/iar/startup_pic32cm3204gv00064.c"
                  version="1.2.0"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="source"
                  name="PIC32CM-GV00/iar/system_pic32cm3204gv00064.c"
                  version="1.2.0"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="PIC32CM-GV00/iar/config/linker/Microchip/pic32cm3204gv00064/sram.icf"
                  version="1.2.0"
                  attr="config"/>
            <file condition="IAR Exe"
                  category="linkerScript"
                  name="PIC32CM-GV00/iar/config/linker/Microchip/pic32cm3204gv00064/flash.icf"
                  version="1.2.0"
                  attr="config"/>
            <file condition="XC Exe"
                  category="source"
                  name="PIC32CM-GV00/xc32/PIC32CM3204GV00064/startup_pic32cm3204gv00064.c"
                  version="1.2.0"
                  attr="config"/>
            <file condition="XC Exe"
                  category="source"
                  name="PIC32CM-GV00/gcc/system_pic32cm3204gv00064.c"
                  version="1.2.0"
                  attr="config"/>
         </files>
      </component>
   </components>
   <taxonomy>
      <description Cclass="Device" Cgroup="Startup">Device specific startup components</description>
   </taxonomy>
</package>
